import warnings

def detect_lamp(filename):
    fn = filename.upper()

    if "HGAR" in fn:
        return "HgAr", [404.656, 435.833, 546.074, 579.066, 696.543, 706.722,
                        727.294, 738.393, 750.387, 763.511, 772.376,
                        794.818, 800.616, 811.531, 826.452, 842.465,
                        852.144, 866.794, 912.292, 922.45]

    elif "NM" in fn:
        return "NM", [404.656, 435.833, 546.074, 1013.976]

    elif "AR" in fn and "HG" not in fn:
        return "AR", [696.543, 727.294, 763.511, 826.452, 866.794, 912.292, 922.45, 965.779]

    elif "KR" in fn:
        return "KR", [587.092, 785.482, 850.887, 892.869]

    warnings.warn("未识别灯类型，使用默认峰")
    return "Unknown", [435.833, 546.074, 696.543, 763.511]
